cask_args appdir: '/Applications'

# Taps

tap 'caskroom/cask'
tap 'd12frosted/emacs-plus'
tap 'gapple/services'
tap 'homebrew/binary'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/fuse'
tap 'phinze/cask'

# Brews

brew 'ack'
brew 'autoconf'
brew 'axel'
brew 'bash'
brew 'bazaar'
brew 'bison'
brew 'clisp'
brew 'cmake'
brew 'coreutils'
brew 'd12frosted/emacs-plus/emacs-plus'
brew 'editorconfig'
brew 'elixir'
brew 'erlang'
brew 'findutils'
brew 'fontconfig'
brew 'freetype'
brew 'git'
brew 'glib'
brew 'gnutls'
brew 'go'
brew 'homebrew/boneyard/ngrok'
brew 'homebrew/dupes/grep'
brew 'homebrew/fuse/sshfs'
brew 'hub'
brew 'imagemagick'
brew 'jpeg'
brew 'jq'
brew 'libffi'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'mackup'
brew 'makedepend'
brew 'mas'
brew 'memcached', restart_service: true
brew 'mongodb'
brew 'nettle'
brew 'node'
brew 'nspr'
brew 'openssl'
brew 'p11-kit'
brew 'pcre'
brew 'pixman'
brew 'postgresql'
brew 'python'
brew 'qt5'
brew 'rabbitmq'
brew 'readline'
brew 'redis', restart_service: true
brew 'rename'
brew 'spidermonkey'
brew 'sqlite'
brew 'the_platinum_searcher'
brew 'tmux'
brew 'tree'
brew 'zsh'

# Casks

cask "alfred"
cask "appcleaner"
cask "dropbox"
cask "flux"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "sketch"
cask "slate"
cask "spotify"
cask "sublime-text"
cask "virtualbox"
cask 'adium'
cask 'arq'
cask 'dropbox'
cask 'firefox'
cask 'iterm2'
cask 'mattr-slate'
cask 'sublime-text'
cask 'transmission'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'vyprvpn'

# Mas

mas 'Airmail 3', id: 918858936
mas 'Chrono Plus', id: 946047238
mas 'Dash', id: 458034879
mas 'Double Shot', id: 1076145960
mas 'Kindle', id: 405399194
mas 'LastPass', id: 926036361
mas 'Sketch', id: 425955336
mas 'Slack', id: 803453959
mas 'Ulysses', id: 623795237
